package locale;

import converter.Locale;

public class RussianLocale extends Locale {
    public RussianLocale() {
        setDigit1(new String[][] {
                {"ноль","один","два","три","четыре","пять","шесть","семь","восемь","девять"},
                {"ноль","одна","две","три","четыре","пять","шесть","семь","восемь","девять"},
        });
        setDigit10(new String[] {"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят",
                "шестьдесят", "семьдесят", "восемьдесят", "девяносто"});
        setDigit11(new String[] {"", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
                "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"});
        setDigit100(new String[] {"", "сто", "двести", "триста", "четыреста", "пятьсот",
                "шестьсот", "семьсот", "восемьсот", "девятьсот"});
        setTriads(new String[][] {
                {"", "", "", "1"},
                {"тысяча", "тысячи", "тысяч", "0"},
                {"миллион", "миллиона", "миллионов", "0"},
                {"миллиард", "миллиарда", "миллиардов", "0"},
                {"триллион", "триллиона", "триллионов", "0"},
        });
    }
}
